In [1]:
import numpy as np

In [2]:
import pandas as pd

#### The biggest difference between NumPy and Pandas is that pandas is designed for working with tabular or heterogeneous data. *NumPy, as we know, is best suited for working with homogeneously typed numerical array data.*

In [3]:
from pandas import Series, DataFrame

### Series:

#### A Series is a one-dimensional array-like object containing a sequence of values(of similar types to NumPy types) of the same type and an associated array of data labels, called its index.

In [4]:
obj = pd.Series([4, 7, -5, 3])

In [5]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [6]:
obj.array

<PandasArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [7]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
obj2 = pd.Series([4, 7, -5, 3], index = ["d", "a", "b", "c"])

In [9]:
obj2.array

<PandasArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [10]:
obj2.index

Index(['d', 'a', 'b', 'c'], dtype='object')

In [11]:
obj2["a"]

7

#### Another way to think about a Series is as a fixed-length, ordered dictionary, as it is a mapping of index values to data values. It can be used in many contexts where you might use a dictionary.

#### If we have data in a Python dictionary, we can create a Series from it by passing the dictionary

In [12]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}

In [13]:
obj3 = pd.Series(sdata)

In [14]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

#### When you are only passing a dictionary, the index in the resulting Series will respect the order of the keys according to the dictionary's keys method, which depends on the key insertion order. You can override this by passing an index with the dictionary keys in the order you want them to appear.

In [15]:
states = ["California", "Ohio", "Oregon", "Texas"]

In [16]:
obj4 = pd.Series(sdata, index=states)

In [17]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

### DataFrame

#### A DataFrame represents a rectangular table of data and contains an ordered, named collection of columns, each of which can be a different value type(numeric, string, Boolean, etc.). The DataFrame has both a row and column index; it can be thought of as a dictionary of Series all sharing the same index.

In [18]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
       "year": [2000, 2001, 2002, 2001, 2002, 2003],
       "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [19]:
frame = pd.DataFrame(data)

In [20]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [21]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [22]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [23]:
pd.DataFrame(data, columns=["year", "state", "pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [24]:
frame2 = pd.DataFrame(data, columns = ["year", "state", "pop", "debt"])

In [25]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [26]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [27]:
frame.columns

Index(['state', 'year', 'pop'], dtype='object')

In [28]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [29]:
frame2["year"]

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

#### Rows can be retrieved by position or name with the special *iloc* and *loc* attributes

In [30]:
frame2.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [31]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [32]:
frame2.debt =np.arange(6.)

In [33]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

#### The column returned from indexing a DataFrame is a view on the underlying data, not a copy. Thus, any in-place modifications to the series will be reflected in the DataFrame. The column can be explicitly copied with the Series's copy method.

### Another common form of data is a nested dictionary of dictionaries

In [34]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
              "Nevada": {2001: 2.4, 2002: 2.9}}

In [35]:
frame3 = pd.DataFrame(populations)

#### If the nested dictionary is passed to the DataFrame, pandas will interpret the outer dictionary keys as the columns, and the inner keys as the row indices

In [36]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [37]:
frame3.T #Similar to numPy array

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [38]:
pandas_object = pd.Series(np.arange(3), index = ["a", "b", "c"])

In [39]:
index = obj.index

In [40]:
index

RangeIndex(start=0, stop=4, step=1)

In [41]:
index[1:]

RangeIndex(start=1, stop=4, step=1)

#### Index objects are immutable and thus can't be modified by the user. Immutability makes it safer to share Index objects among data structures.

In [42]:
labels = pd.Index(np.arange(3))

In [43]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [44]:
another_pandas_object = pd.Series([1.5, -2.5, 0], index=labels)

In [45]:
another_pandas_object

0    1.5
1   -2.5
2    0.0
dtype: float64

In [46]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [47]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object')

In [48]:
"Ohio" in frame3.columns

True

In [49]:
2003 in frame3.columns

False

In [50]:
frame3.index

Int64Index([2000, 2001, 2002], dtype='int64')

In [51]:
2003 in frame3.index

False

#### *Unlike Python sets, a pandas Index can contain duplicate labels*

### Reindexing

#### An important method on pandas objects is reindex, which means to create a new object with the values rearranged to align the new index.

In [52]:
sample_pandas_object = pd.Series([4.5, 7.2, -5.3, 3.6], index = ["d", "b", "c", "a"])

In [53]:
reindexed_pandas_object = sample_pandas_object.reindex(["a", "b", "c", "d", "e"])

In [54]:
sample_pandas_object

d    4.5
b    7.2
c   -5.3
a    3.6
dtype: float64

In [55]:
reindexed_pandas_object

a    3.6
b    7.2
c   -5.3
d    4.5
e    NaN
dtype: float64

#### *For ordered data like time series, you may want to do some interpolation or filling of values when reindexing. The method option allows us to do this, using a method such as ffill, which forward-fills the values*

In [56]:
yet_another_pandas_object = pd.Series(["blue", "purple", "yellow"], index=[0, 2, 4])

In [57]:
yet_another_pandas_object

0      blue
2    purple
4    yellow
dtype: object

In [58]:
yet_another_pandas_object.reindex(np.arange(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [59]:
again_pandas_object = pd.DataFrame(np.arange(9).reshape(3, 3), index=["a", "c", "d"], columns=["Ohio", "Texas", "California"])

In [60]:
again_pandas_object

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [61]:
again_pandas_object_reindex = again_pandas_object.reindex(index = ["a", "b", "c", "d"])

In [62]:
again_pandas_object_reindex

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [63]:
states_list = ["Texas", "Utah", "California"]

In [64]:
again_pandas_object_reindex.reindex(columns = states_list)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [65]:
again_pandas_object_reindex.reindex(states_list, axis="columns")#Similar to the above, only change is the intro of axis keyword

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

### Selection on DataFrame with loc and iloc

In [66]:
again_pandas_object_reindex.loc[["a", "d", "c"], ["California", "Texas"]]

   California  Texas
a         2.0    1.0
d         8.0    7.0
c         5.0    4.0

### Dropping Entries from an Axis

In [67]:
pandas_obj = pd.Series(np.arange(5.), index = ["a", "b", "c", "d", "e"])

In [68]:
pandas_obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [69]:
new_pandas_obj = pandas_obj.drop("c")

In [70]:
new_pandas_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

#### With DataFrame, index values can be deleted from either exis.

In [71]:
df_object = pd.DataFrame(np.arange(16).reshape(4, 4),
                        index = ["Ohio", "Colorado", "Utah", "New York"],
                        columns = ["one", "two", "three", "four"])

In [72]:
df_object

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [73]:
df_object.drop(index=["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [74]:
df_object.drop(columns="two")

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [75]:
df_object.drop("two", axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [76]:
df_object.drop(["two", "four"], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [77]:
df_object["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [78]:
df_object[["three", "one"]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [79]:
df_object[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [132]:
covid_sample_data = pd.read_excel("/Users/biswajeetparija/Local_Storage/Documents/Covid_sample_dataset_1.xlsx")

In [133]:
covid_sample_data.head()

,S.No,State,District,% Contribution of Testing by RAT,% Contribution of Testing by RTPCR,Positivity
0,1.0,ANDAMAN AND NICOBAR ISLANDS,NORTH AND MIDDLE ANDAMAN,0,100,100.00
1,2.0,ANDAMAN AND NICOBAR ISLANDS,SOUTH ANDAMANS,14,86,14.29
2,3.0,ANDHRA PRADESH,EAST GODAVARI,81,19,10.78
3,4.0,ARUNACHAL PRADESH,PAPUM PARE,33,67,25.00
4,5.0,ASSAM,LAKHIMPUR,50,50,100.00

#### If we want to return specific rows of data (including all columns) - *The below is a specific label based indexing process*

In [134]:
covid_sample_data.loc[0:1]

,S.No,State,District,% Contribution of Testing by RAT,% Contribution of Testing by RTPCR,Positivity
0,1.0,ANDAMAN AND NICOBAR ISLANDS,NORTH AND MIDDLE ANDAMAN,0,100,100.00
1,2.0,ANDAMAN AND NICOBAR ISLANDS,SOUTH ANDAMANS,14,86,14.29

In [135]:
covid_sample_data.iloc[0:1]

,S.No,State,District,% Contribution of Testing by RAT,% Contribution of Testing by RTPCR,Positivity
0,1.0,ANDAMAN AND NICOBAR ISLANDS,NORTH AND MIDDLE ANDAMAN,0,100,100.0

#### The difference between loc and iloc is that loc includes the both the starting and ending points. For example covid_sample_data.loc[0:1] will return both 0th label and 1st label, but with iloc it'll only return the 0th label.

In [136]:
covid_sample_data.iloc[0:len(covid_sample_data)-1]

,S.No,State,District,% Contribution of Testing by RAT,% Contribution of Testing by RTPCR,Positivity
0,1.0,ANDAMAN AND NICOBAR ISLANDS,NORTH AND MIDDLE ANDAMAN,0,100,100.00
1,2.0,ANDAMAN AND NICOBAR ISLANDS,SOUTH ANDAMANS,14,86,14.29
2,3.0,ANDHRA PRADESH,EAST GODAVARI,81,19,10.78
3,4.0,ARUNACHAL PRADESH,PAPUM PARE,33,67,25.00
4,5.0,ASSAM,LAKHIMPUR,50,50,100.00
...,...,...,...,...,...,...
141,142.0,UTTARAKHAND,PAURI GARHWAL,72,28,11.49
142,143.0,UTTARAKHAND,ALMORA,55,45,10.95
143,144.0,WEST BENGAL,KOLKATA,9,91,13.15
144,145.0,WEST BENGAL,KALIMPONG,25,75,12.50
145,146.0,WEST BENGAL,DARJEELING,37,63,10.13

In [137]:
covid_sample_data.iloc[0:16]

,S.No,State,District,% Contribution of Testing by RAT,% Contribution of Testing by RTPCR,Positivity
0,1.0,ANDAMAN AND NICOBAR ISLANDS,NORTH AND MIDDLE ANDAMAN,0,100,100.00
1,2.0,ANDAMAN AND NICOBAR ISLANDS,SOUTH ANDAMANS,14,86,14.29
2,3.0,ANDHRA PRADESH,EAST GODAVARI,81,19,10.78
3,4.0,ARUNACHAL PRADESH,PAPUM PARE,33,67,25.00
4,5.0,ASSAM,LAKHIMPUR,50,50,100.00
5,6.0,ASSAM,UDALGURI,50,50,50.00
6,7.0,ASSAM,GOALPARA,83,17,16.67
7,8.0,ASSAM,DARRANG,100,0,11.43
8,9.0,CHANDIGARH,CHANDIGARH,24,76,11.31
9,10.0,CHHATTISGARH,BEMETARA,98,2,26.76
10,11.0,CHHATTISGARH,GAURELLA PENDRA MARWAHI,38,62,19.34
11,12.0,CHHATTISGARH,SURGUJA,80,20,16.72
12,13.0,CHHATTISGARH,DURG,68,32,16.23
13,14.0,CHHATTISGARH,SURAJPUR,96,4,13.21
14,15.0,CHHATTISGARH,KANKER,97,3,12.70
15,16.0,CHHATTISGARH,RAJNANDGAON,97,3,12.33

In [147]:
covid_sample_data[covid_sample_data["Positivity"]>25.00]

,S.No,State,District,% Contribution of Testing by RAT,% Contribution of Testing by RTPCR,Positivity
0,1.0,ANDAMAN AND NICOBAR ISLANDS,NORTH AND MIDDLE ANDAMAN,0,100,100.00
4,5.0,ASSAM,LAKHIMPUR,50,50,100.00
5,6.0,ASSAM,UDALGURI,50,50,50.00
9,10.0,CHHATTISGARH,BEMETARA,98,2,26.76
20,21.0,DELHI,EAST,22,78,37.08
21,22.0,DELHI,NORTH WEST,26,74,32.48
22,23.0,DELHI,CENTRAL,21,79,31.93
23,24.0,DELHI,SOUTH,18,82,31.82
24,25.0,DELHI,WEST,35,65,28.89
25,26.0,DELHI,SOUTH EAST,46,54,28.13
26,27.0,DELHI,NEW DELHI,12,88,27.43
27,28.0,DELHI,NORTH,48,52,25.36
34,35.0,HARYANA,YAMUNANAGAR,3,97,45.64
44,45.0,HIMACHAL PRADESH,SIRMAUR,45,55,26.18
45,46.0,HIMACHAL PRADESH,UNA,33,67,25.17
52,53.0,JAMMU AND KASHMIR,ANANTNAG,14,86,32.00
57,58.0,JHARKHAND,SARAIKELA KHARSAWAN,83,17,50.00
58,59.0,JHARKHAND,LOHARDAGA,100,0,35.00
61,62.0,KERALA,ERNAKULAM,58,42,38.73
62,63.0,KERALA,KOLLAM,75,25,33.79
63,64.0,KERALA,IDUKKI,67,33,33.70
64,65.0,KERALA,KOTTAYAM,71,29,32.56
65,66.0,KERALA,WAYANAD,56,44,32.20
66,67.0,KERALA,PATHANAMTHITTA,63,37,31.61
67,68.0,KERALA,KOZHIKODE,43,57,28.50
68,69.0,KERALA,THRISSUR,55,45,28.40
69,70.0,KERALA,PALAKKAD,65,35,25.84
76,77.0,MADHYA PRADESH,ALIRAJPUR,0,100,33.33
77,78.0,MADHYA PRADESH,MANDLA,14,86,28.57
78,79.0,MADHYA PRADESH,SHEOPUR,0,100,28.57
79,80.0,MADHYA PRADESH,BALAGHAT,27,73,27.27
100,101.0,MEGHALAYA,EAST JAINTIA HILLS,100,0,66.67
101,102.0,MIZORAM,AIZAWL,79,21,35.71
136,137.0,UTTARAKHAND,PITHORAGARH,63,37,43.33

In [152]:
covid_sample_data.iloc[2, [0, 1, 2, 5]]

S.No                     3.0
State         ANDHRA PRADESH
District       EAST GODAVARI
Positivity             10.78
Name: 2, dtype: object